01  WS-AREA-1 PIC 9(5) VALUE ZEROS.
01  WS-AREA-2 PIC 9(5) VALUE ZEROS.

PROCEDURE DIVISION.
    COMPUTE WS-AREA-1 = 12345.
    COMPUTE WS-AREA-2 = WS-AREA-1 / 0.
    DISPLAY WS-AREA-2.
    STOP RUN.