01  WS-AREA-1 PIC 9(5) VALUE ZEROS.
01  WS-AREA-2 PIC 9(5) VALUE ZEROS.
01  WS-DIVISOR PIC 9(5) VALUE ZEROS.

PROCEDURE DIVISION.
    COMPUTE WS-AREA-1 = 12345.
    COMPUTE WS-DIVISOR = 0.
    IF WS-DIVISOR = 0 THEN 
        DISPLAY "Division by zero detected.  Result is undefined." 
    ELSE 
        COMPUTE WS-AREA-2 = WS-AREA-1 / WS-DIVISOR
        DISPLAY WS-AREA-2
    END-IF
    STOP RUN.